# Задача 4:

sum = int(input('Введите сумму: '))
print(sum // 6, sum * 4 // 6, sum // 6)

#или

sum2 = int(input('Введите сумму: '))
k = int(sum2 / 3 * 2) 
p = s = int(sum2 / 3 / 2)
print(p, k, s)